# Pandas Complete Tutorial
### By Samrat Mitra (https://www.github.com/lionelsamrat10)

## Import Libraries

In [1]:
import pandas as pd
import numpy as np

## Create a Dictionary in Python

In [4]:
dict1 = {
    "name": ['Samrat', 'Sarah', 'Dave', 'Sophie'],
    "marks": [50, 49, 47, 50],
    "city": ['Jalpaiguri', 'Los Angeles', 'Montreal', 'London']
}

## Convert the Dictionary to a Dataframe

***Convert the dictionary dict1 to a dataframe***

In [5]:
df = pd.DataFrame(dict1)

***Print the Dataframe***

In [8]:
df

     name  marks         city
0  Samrat     50   Jalpaiguri
1   Sarah     49  Los Angeles
2    Dave     47     Montreal
3  Sophie     50       London

***Convert the dataframe to csv file***

In [11]:
df.to_csv('students.csv', index = False) # The data will not have any index values

## Get the first few rows of a dataframe

In [12]:
df.head(2)

     name  marks         city
0  Samrat     50   Jalpaiguri
1   Sarah     49  Los Angeles

## Get the last few rows of a dataframe

In [13]:
df.tail(2)

     name  marks      city
2    Dave     47  Montreal
3  Sophie     50    London

## Get the shape of the dataframe

In [14]:
df.shape

(4, 3)

## Get the Description of the data

In [17]:
df.describe() # Performs statistical analysis on the data

           marks
count   4.000000
mean   49.000000
std     1.414214
min    47.000000
25%    48.500000
50%    49.500000
75%    50.000000
max    50.000000

## Read a CSV File

In [18]:
dataframe = pd.read_csv('Salary_Data.csv')

In [19]:
dataframe

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [21]:
dataframe.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [22]:
dataframe.shape

(30, 2)

### Get the Salary of the 10th employee using the dataframe

In [25]:
dataframe['Salary'][9]

57189.0

### Reading a HTML table from the web

In [36]:
# Read HTML tables into a list of DataFrame objects.
url = r'https://en.wikipedia.org/wiki/List_of_Germans_by_net_worth'
tables = pd.read_html(url, header=0)

df_net_worth = tables[0] # tables[0] denotes the first table in the page

# Asserts can be useful for sanity checks
assert len(df_net_worth) > 0 
assert df_net_worth.Name.is_unique


df_net_worth.head() # Shows only the first five entries

,World ranking,Name,Citizenship,Net worth (USD),Sources of wealth
0,34,Beate Heister (b. Albrecht) & Karl Albrecht Jr.,Germany,39.2 billion,Aldi Süd
1,38,Dieter Schwarz,Germany,36.9 billion,Schwarz Gruppe
2,53,Susanne Klatten,Germany,27.7 billion,"BMW, Altana, Nordex, SGL Carbon"
3,58,Klaus-Michael Kühne,Germany,26.3 billion,Kuehne + Nagel
4,81,Stefan Quandt,Germany,21.6 billion,BMW

In [37]:
df_net_worth

,World ranking,Name,Citizenship,Net worth (USD),Sources of wealth
0,34,Beate Heister (b. Albrecht) & Karl Albrecht Jr.,Germany,39.2 billion,Aldi Süd
1,38,Dieter Schwarz,Germany,36.9 billion,Schwarz Gruppe
2,53,Susanne Klatten,Germany,27.7 billion,"BMW, Altana, Nordex, SGL Carbon"
3,58,Klaus-Michael Kühne,Germany,26.3 billion,Kuehne + Nagel
4,81,Stefan Quandt,Germany,21.6 billion,BMW
5,98,Theo Albrecht Jr.,Germany,18.8 billion,Aldi Nord and Trader Joe's
6,115,Reinhold Wuerth,Germany,16.8 billion,Würth Group
7,133,Georg Schaeffler,Germany,14.9 billion,Schaeffler Group
8,186,Alexander Otto,Germany,11.8 billion,Otto Group
9,200,Thomas Strüngmann,Germany,11.0 billion,"Hexal, BioNTech"
10,200,Andreas Strüngmann,Germany,11.0 billion,"Hexal, BioNTech"
11,224,Dietmar Hopp,Germany,10.1 billion,SAP
12,234,Friedhelm Loh,Germany,9.7 billion,Friedhelm Loh Group
13,256,Wolfgang Marguerre,Germany,8.9 billion,Octapharma
14,264,Michael Otto,Germany,8.9 billion,Otto Group
15,269,August von Finck Jr.,Germany,8.8 billion,"Merck Finck & Co., Allianz, Hochtief, Löwenbrä..."
16,297,Hasso Plattner,Germany,8.3 billion,SAP
17,304,Andreas von Bechtolsheim,Germany,8.2 billion,"Sun Microsystems, Arista Networks"
18,369,Ludwig Merckle,Germany,7.0 billion,"Phoenix Pharmahandel, Ratiopharm, HeidelbergCe..."
19,384,Aloys Wobben,Germany,6.8 billion,Enercon
20,384,Erich Wesjohan,Germany,6.8 billion,EW Group
21,404,Horst Julius Pudwill,Germany,6.5 billion,Techtronic Industries
22,421,Axel Oberwelland,Germany,6.3 billion,August Storck
23,451,Guenther Fielmann,Germany,6.0 billion,Fielmann
24,451,Juergen Blickle,Germany,6.0 billion,Eurodrive
25,502,Alexandra Schörghuber,Germany,5.5 billion,Schörghuber Unternehmensgruppe
26,520,Rainer Blickle,Germany,5.4 billion,Eurodrive
27,550,Theo Müller,Germany,5.1 billion,Müller
28,550,Michael Herz,Germany,5.1 billion,"Tchibo, Beiersdorf"
29,550,Wolfgang Herz,Germany,5.1 billion,"Tchibo, Beiersdorf"

### Reading from databases is also possible.

**Reading** from Microsoft SQL using **pyodbc** and **pd.read_sql(sql_code, connection)**.

Methods on DataFrames **return a new instance** by default. In other words, they behave like methods on immutable Python object, and not like methods on mutable objects.

In [38]:
# Lists are MUTABLE
scores = [6, 2, 4, 9, 1]
scores.sort()  # Changes the object in-place, returns None
print(scores)

# Strings are IMMUTABLE
my_name = 'tommy'
my_name = my_name.capitalize()  # A new instance is returned
print(my_name)

[1, 2, 4, 6, 9]
Tommy

### How to changes the index values

In [42]:
df.index = ['first', 'second', 'third', 'fourth']

In [44]:
df # The indices are changed from 0, 1, 2, 3 to first, second, third and fourth

          name  marks         city
first   Samrat     50   Jalpaiguri
second   Sarah     49  Los Angeles
third     Dave     47     Montreal
fourth  Sophie     50       London

### Two data structures in Pandas: Series and DataFrame

In [48]:
type(df['marks']) # Its a Series

pandas.core.series.Series

In [49]:
type(df)

pandas.core.frame.DataFrame